; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-5degree-100mindistance-4trucks-2packages-468seed

(define (problem transport-two-cities-sequential-5nodes-1000size-5degree-100mindistance-4trucks-2packages-468seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 59,601 -> 209,389
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 26)
  ; 209,389 -> 59,601
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 26)
  ; 95,191 -> 209,389
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 23)
  ; 209,389 -> 95,191
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 23)
  ; 95,191 -> 59,601
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 42)
  ; 59,601 -> 95,191
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 42)
  ; 712,658 -> 209,389
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 57)
  ; 209,389 -> 712,658
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 57)
  ; 712,658 -> 59,601
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 66)
  ; 59,601 -> 712,658
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 66)
  ; 963,391 -> 712,658
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 37)
  ; 712,658 -> 963,391
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 37)
  ; 2555,477 -> 2154,745
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 49)
  ; 2154,745 -> 2555,477
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 49)
  ; 2887,673 -> 2555,477
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 39)
  ; 2555,477 -> 2887,673
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 39)
  ; 2433,679 -> 2154,745
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 29)
  ; 2154,745 -> 2433,679
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 29)
  ; 2433,679 -> 2555,477
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 24)
  ; 2555,477 -> 2433,679
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 24)
  ; 2433,679 -> 2887,673
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 46)
  ; 2887,673 -> 2433,679
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 46)
  ; 2727,297 -> 2555,477
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 25)
  ; 2555,477 -> 2727,297
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 25)
  ; 2727,297 -> 2887,673
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 41)
  ; 2887,673 -> 2727,297
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 41)
  ; 2727,297 -> 2433,679
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 49)
  ; 2433,679 -> 2727,297
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 49)
  ; 963,391 <-> 2154,745
  (road city-1-loc-5 city-2-loc-1)
  (= (road-length city-1-loc-5 city-2-loc-1) 125)
  (road city-2-loc-1 city-1-loc-5)
  (= (road-length city-2-loc-1 city-1-loc-5) 125)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
  (at truck-1 city-2-loc-2)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-3)
  (at truck-3 city-2-loc-2)
  (capacity truck-3 capacity-3)
  (at truck-4 city-2-loc-1)
  (capacity truck-4 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-1 city-1-loc-5)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-1-loc-5)
   goals met: 0 of 2
2. (drive truck-2 city-1-loc-5 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 2
3. (drive truck-2 city-1-loc-4 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 2
4. (pick-up truck-2 city-1-loc-1 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-1-loc-1) (capacity truck-2 capacity-3)
   added: (in package-1 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 2
5. (drive truck-2 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 2
6. (pick-up truck-2 city-1-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-3) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 2
7. (drive truck-2 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 2
8. (drive truck-2 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 2
9. (drive truck-2 city-1-loc-4 city-1-loc-5)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-5)
   goals met: 0 of 2
10. (drive truck-2 city-1-loc-5 city-2-loc-1)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-2-loc-1)
   goals met: 0 of 2
11. (drive truck-2 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 2
12. (drop truck-2 city-2-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-2-loc-2) (capacity truck-2 capacity-2)
   goals met: 1 of 2
13. (drive truck-2 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-3)
   goals met: 1 of 2
14. (drop truck-2 city-2-loc-3 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-2)
   added: (at package-1 city-2-loc-3) (capacity truck-2 capacity-3)
   goals met: 2 of 2
